----------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\ronco\Desktop\Tesis_Nicho_Janampa\GPT-Impact-GitHub\output/analysis.log
  log type:  text
 opened on:   8 May 2024, 16:43:56

. 
. import delimited "output/data.csv", clear
(encoding automatically selected: ISO-8859-1)
(14 vars, 48,640 obs)

. 
. drop if iso2_code == "HK"
(304 observations deleted)

. 
end of do-file

. do "C:\Users\ronco\AppData\Local\Temp\STD34c0_000000.tmp"

. 
. eststo est_sdid: sdid num_pushers_pc unique_id quarter treatment, ///
>         vce(bootstrap) reps(100) seed(1234) method(sdid) graph g1on ///
>         g1_opt(xtitle("") scheme(sj)) ///
>         g2_opt(ytitle("Pushers per 100k inhabitants") scheme(sj) ///
>         xtitle("Quarters since 2020Q1")) 
Bootstrap replications (100). This may take some time.
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5
..................................................     50
..................................................     100


Synthetic Difference-in-Differences Estimator

-----------------------------------------------------------------------------
num_pusher~c |     ATT     Std. Err.     t      P>|t|    [95% Conf. Interval]
-------------+---------------------------------------------------------------
   treatment |   1.21494    0.20084     6.05    0.000     0.82131     1.60858
-----------------------------------------------------------------------------
95% CIs and p-values are based on Large-Sample approximations.
Refer to Arkhangelsky et al., (2020) for theoretical derivations.

. 
. graph export sd_id_analysis.png, as(png) replace
file sd_id_analysis.png saved as PNG format

. 
end of do-file

. 
. do "C:\Users\ronco\AppData\Local\Temp\STD34c0_000000.tmp"

. graph export sd_id_analysis.png, as(png) replace
could not find Graph window
r(693);

end of do-file

r(693);

. do "C:\Users\ronco\AppData\Local\Temp\STD34c0_000000.tmp"

. 
. eststo est_sdid: sdid num_pushers_pc unique_id quarter treatment, ///
>         vce(bootstrap) reps(100) seed(1234) method(sdid) graph g1on ///
>         g1_opt(xtitle("") scheme(sj)) ///
>         g2_opt(ytitle("Pushers per 100k inhabitants") scheme(sj) ///
>         xtitle("Quarters since 2020Q1")) 
Bootstrap replications (100). This may take some time.
----+--- 1 ---+--- 2 ---+--- 3 ---+--- 4 ---+--- 5
..................................................     50
..................................................     100


Synthetic Difference-in-Differences Estimator

-----------------------------------------------------------------------------
num_pusher~c |     ATT     Std. Err.     t      P>|t|    [95% Conf. Interval]
-------------+---------------------------------------------------------------
   treatment |   1.21494    0.20084     6.05    0.000     0.82131     1.60858
-----------------------------------------------------------------------------
95% CIs and p-values are based on Large-Sample approximations.
Refer to Arkhangelsky et al., (2020) for theoretical derivations.

. 
. graph export sd_id_analysis.png, as(png) replace
file sd_id_analysis.png saved as PNG format

. 
end of do-file

. graph save "g2_12" "C:\Users\ronco\Downloads\grafica2.gph"
file C:\Users\ronco\Downloads\grafica2.gph saved

